# Symbol

## Description
Procedure Symbol places a symbol in the document at the specified coordinate location.

```pascal
PROCEDURE Symbol(
				symbolName    : STRING;
				p             : REAL;
				rotationAngle : REAL);
```

```python

def vs.Symbol(symbolName, p, rotationAngle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symbolName|STRING|Name of symbol.|
|p|REAL|Coordinates of symbol insertion point.|
|rotationAngle|REAL|Rotation angle of symbol, in degrees.|

## Version
Availability: from MiniCAD
## Category
* Objects - Symbols